{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v2.0.1", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 80, 80, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_Conv2D1_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D1", "trainable": true, "batch_input_shape": [null, 80, 80, 3], "dtype": "float32", "filters": 8, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_MaxPooling2D1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_MaxPooling2D2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_Flatten1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_Dense1", "trainable": true, "dtype": "float32", "units": 22, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_Conv2D1/kernel", "shape": [5, 5, 3, 8], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.24912603760466856, "scale": 0.001961622343343847, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D1/bias", "shape": [8], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.01905051903689609, "scale": 0.00015119459553092135, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D2/kernel", "shape": [5, 5, 8, 16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1725886193560619, "scale": 0.0013589655067406448, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D2/bias", "shape": [16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.02432454826638979, "scale": 0.00018018183901029474, "original_dtype": "float32"}}, {"name": "dense_Dense1/kernel", "shape": [4624, 22], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07852120230010912, "scale": 0.0006040092484623778, "original_dtype": "float32"}}, {"name": "dense_Dense1/bias", "shape": [22], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.013009554432595478, "scale": 0.00013275055543464774, "original_dtype": "float32"}}]}]}