{"format": "graph-model", "generatedBy": "2.8.0-rc1", "convertedBy": "TensorFlow.js Converter v2.0.1", "userDefinedMetadata": {"signature": {"inputs": {"conv2d_conv2d1_input:0": {"name": "conv2d_conv2d1_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "80"}, {"size": "80"}, {"size": "3"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "22"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/conv2d_Conv2D1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "3"}, {"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_Conv2D1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_Conv2D2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "8"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_Conv2D2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten_Flatten1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_Dense1/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4624"}, {"size": "22"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_Dense1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "22"}]}}}}}, {"name": "conv2d_conv2d1_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "80"}, {"size": "80"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_Conv2D1/Relu", "op": "_FusedConv2D", "input": ["conv2d_conv2d1_input", "StatefulPartitionedCall/sequential_1/conv2d_Conv2D1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_Conv2D1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_MaxPooling2D1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv2d_Conv2D1/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_Conv2D2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_MaxPooling2D1/MaxPool", "StatefulPartitionedCall/sequential_1/conv2d_Conv2D2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_Conv2D2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_MaxPooling2D2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv2d_Conv2D2/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten_Flatten1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_MaxPooling2D2/MaxPool", "StatefulPartitionedCall/sequential_1/flatten_Flatten1/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_Dense1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/flatten_Flatten1/Reshape", "StatefulPartitionedCall/sequential_1/dense_Dense1/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_Dense1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_Dense1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_1/dense_Dense1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/dense_Dense1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 987}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1/conv2d_Conv2D1/Conv2D/ReadVariableOp", "shape": [5, 5, 3, 8], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.24912603760466856, "scale": 0.001961622343343847, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_Conv2D1/BiasAdd/ReadVariableOp", "shape": [8], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.01905051903689609, "scale": 0.00015119459553092135, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_Conv2D2/Conv2D/ReadVariableOp", "shape": [5, 5, 8, 16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1725886193560619, "scale": 0.0013589655067406448, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_Conv2D2/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.02432454826638979, "scale": 0.00018018183901029474, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/sequential_1/flatten_Flatten1/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_Dense1/MatMul/ReadVariableOp", "shape": [4624, 22], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07852120230010912, "scale": 0.0006040092484623778, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/sequential_1/dense_Dense1/BiasAdd/ReadVariableOp", "shape": [22], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.013009554432595478, "scale": 0.00013275055543464774, "original_dtype": "float32"}}]}]}